FutureDesigns/uEZ/uEZ/Source/Devices/USBDevice/NXP/LPC1768/LPC1768_USBDevice.c
/*-------------------------------------------------------------------------*
 * File:  lpc1768_USBDevice.c
 *-------------------------------------------------------------------------*
 * Description:
 *      Device implementation of the NXP LPC1768 USBDevice Bus.
 *-------------------------------------------------------------------------*/

/*--------------------------------------------------------------------------
 * uEZ(R) - Copyright (C) 2007-2010 Future Designs, Inc.
 *--------------------------------------------------------------------------
 * This file is part of the uEZ(R) distribution.  See the included
 * uEZLicense.txt or visit http://www.teamfdi.com/uez for details.
 *
 *    *===============================================================*
 *    |  Future Designs, Inc. can port uEZ(tm) to your own hardware!  |
 *    |             We can get you up and running fast!               |
 *    |      See http://www.teamfdi.com/uez for more details.         |
 *    *===============================================================*
 *
 *-------------------------------------------------------------------------*/
#include <string.h>
#include <uEZ.h>
#include <uEZDeviceTable.h>
#include <uEZRTOS.h>
#include <HAL/HAL.h>
#include <HAL/USBDeviceController.h>
#include <Types/USBDevice.h>
#include "LPC1768_USBDevice.h"


/*---------------------------------------------------------------------------*
 * Types:
 *---------------------------------------------------------------------------*/
typedef struct {
    const DEVICE_USB_DEVICE *iDevice;
    T_uezSemaphore iSem;
    T_uezSemaphore iReady;
    T_uezSemaphore iProcess;
    HAL_USBDeviceController **iUSBDeviceController;
    T_USBDevice iUSBDevice;
    TUInt8 iStandardBuffer[USB_ENDPOINT0_PACKET_SIZE];
    T_USBSetupPacket iSetupPacket;
    TUInt8 *iPacketData;
    TUInt16 iPacketLength;
    TUInt16 iPacketRemaining;
    TBool iNeedSetAddress;
    TUInt8 iUSBAddress;
    TUInt8 iSmallPacket[8];
} T_USBDevice_LPC1768_Workspace;

/*---------------------------------------------------------------------------*
 * Prototypes:
 *---------------------------------------------------------------------------*/
static TBool NXP_LPC1768_USBDevice_StandardDeviceRequest(
                void *aWorkspace,
                T_USBSetupPacket *aSetup,
                TUInt16 *aLength,
                TUInt8 **aData);
static void INXP_LPC1768_StandardControlTransfer(
        void *aWorkspace,
        TUInt8 aEndpoint,
        T_USBEndpointStatus aStatus);
static void INXP_LPC1768_USBDevice_EndpointReady(void *aCallbackWorkspace);

#define dprintf(...)

/*---------------------------------------------------------------------------*
 * Routine:  USBDevice_NXP_InitializeWorkspace_USBDevice
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup a USBDevice Bus called USBDevice0 and semaphore to ensure single accesses
 *      at a time.
 * Inputs:
 *      void *aWorkspace                    -- Workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
static T_uezError USBDevice_NXP_InitializeWorkspace_USBDevice(void *aWorkspace)
{
    T_uezError error;

    T_USBDevice_LPC1768_Workspace *p = (T_USBDevice_LPC1768_Workspace *)aWorkspace;

    // Access the USBDevice0 device
    error = HALInterfaceFind(
                "USBDeviceController",
                (T_halWorkspace **)&p->iUSBDeviceController);
    if (error)
        return error;

    // Then create a semaphore to limit the number of accessors
    error = UEZSemaphoreCreateBinary(&p->iSem);
    if (error)
        return error;
    error = UEZSemaphoreCreateBinary(&p->iProcess);
    if (error)
        return error;
    error = UEZSemaphoreCreateBinary(&p->iReady);
    if (error)
        return error;

    memset(&p->iUSBDevice, 0, sizeof(p->iUSBDevice));
    p->iUSBDevice.iRequestTypeHandlers[USB_REQUEST_TYPE_STANDARD].iBuffer =
            p->iStandardBuffer;
    p->iUSBDevice.iRequestTypeHandlers[USB_REQUEST_TYPE_STANDARD].iHandler =
            NXP_LPC1768_USBDevice_StandardDeviceRequest;
    p->iUSBDevice.iRequestTypeHandlers[USB_REQUEST_TYPE_STANDARD].iWorkspace =
            aWorkspace;
    p->iUSBDevice.iStatusEndpointReadyFunc = INXP_LPC1768_USBDevice_EndpointReady;
    p->iUSBDevice.iStatusChangeFunc = 0; // undefined

    // These are ALWAYS set to the standard control transfer at first
    p->iUSBDevice.iEndpointFuncs[0].iIn = INXP_LPC1768_StandardControlTransfer;
    p->iUSBDevice.iEndpointFuncs[0].iOut = INXP_LPC1768_StandardControlTransfer;
    p->iUSBDevice.iCallbackWorkspace = p;

    // No address and no need to set it
    p->iNeedSetAddress = EFalse;
    p->iUSBAddress = 0;

    return error;
}

/*-------------------------------------------------------------------------*
 * Internal Function:  IUSBCreateDataInPacket
 *-------------------------------------------------------------------------*
 * Description:
 *      Create a DATAIN packet on the USB bus by parsing the data
 *      into 64 byte blocks.
 * Inputs:
 *      T_USBDevice_LPC1768_Workspace *p -- Workspace
 *-------------------------------------------------------------------------*/
static void IUSBCreateDataInPacket(T_USBDevice_LPC1768_Workspace *p)
{
    TUInt16 numBytesToSend;

    // Decide how many bytes to send
    numBytesToSend = p->iPacketRemaining;
    if (numBytesToSend > 64)
        numBytesToSend = 64;

    // Send data
    ((*p->iUSBDeviceController)->Write)(
            p->iUSBDeviceController,
            ENDPOINT_IN(0),
            p->iPacketData,
            numBytesToSend);

    // Update pointer and remaining size
    p->iPacketRemaining -= numBytesToSend;
    p->iPacketData += numBytesToSend;
}


/*-------------------------------------------------------------------------*
 * Internal Function:  ICallSetupHandler
 *-------------------------------------------------------------------------*
 * Description:
 *      Intermediate function that looks up the type of the setup packet
 *      and the corresponding pointer to function to call.  The called
 *      function then handles the packet and returns ETrue.  Otherwise,
 *      it returns EFalse.
 * Inputs:
 *      T_USBDevice_LPC1768_Workspace *p -- Workspace
 *      T_USBSetupPacket *aSetup  -- Pointer to setup packet to handle
 *      TUInt16 *aLength          -- Length of data attached to packet.
 *      TUInt8 **aData            -- Pointer to data attached to packet.
 *-------------------------------------------------------------------------*/
static TBool ICallSetupHandler(
                T_USBDevice_LPC1768_Workspace *p,
                T_USBSetupPacket *aSetup,
                TUInt16 *aLength,
                TUInt8 **aData)
{
    T_USBDeviceRequestTypeHandlerStruct *p_handler;

dprintf("[H%d]", aSetup->iRequestType.iRecipientType);
    // Use the appropriate handler for the type of setup packet.
    // If it doesn't exist, return with an error.
    if (aSetup->iRequestType.iRecipientType <= USB_REQUEST_TYPE_RESERVED)  {
        p_handler = &p->iUSBDevice.iRequestTypeHandlers[
                        aSetup->iRequestType.iRecipientType];
        if (p_handler->iHandler) {
            return (p_handler->iHandler)(
                        p_handler->iWorkspace,
                        aSetup,
                        aLength,
                        aData);
        } else {
dprintf("[NoHand1]");
        }
    } else {
dprintf("[NoHand2]");
        // Unknown type we could not handle
        return EFalse;
    }
    return EFalse;
}

