FutureDesigns/uEZ/uEZ/Source/Devices/USBDevice/NXP/LPC1768/LPC1768_USBDevice.c
    UEZSemaphoreRelease(p->iSem);
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  NXP_LPC1768_USBDevice_RegisterEndpointCallback
 *---------------------------------------------------------------------------*
 * Description:
 *      Register a endpoint callback routine that is called when data
 *      is ready/requested on the given endpoint and ProcessEndpoints is
 *      called.
 * Inputs:
 *      void *aWorkspace          -- USB Device's workspace
 *      TUInt8 aEndpoint          -- Endpoint to set callback.  Use
 *                                  macros ENDPOINT_IN or ENDPOINT_OUT
 *                                  to set if the endpoint is in or out.
 *      T_USBEndpointHandlerFunc aEndpointFunc -- Pointer to function to
 *                                  call when data is ready and
 *                                  ProcessEndpoints is called.
 * Outputs:
 *      T_uezError                 -- Error code UEZ_ERROR_NOT_AVAILABLE
 *                                      is returned if endpoint is already
 *                                      registered, or UEZ_ERROR_NONE if
 *                                      successful.
 *---------------------------------------------------------------------------*/
static T_uezError NXP_LPC1768_USBDevice_RegisterEndpointCallback(
            void *aWorkspace,
            TUInt8 aEndpoint,
            T_USBEndpointHandlerFunc aEndpointFunc)
{
    T_uezError error = UEZ_ERROR_NONE;
    T_USBDevice_LPC1768_Workspace *p =
        (T_USBDevice_LPC1768_Workspace *)aWorkspace;
    T_USBEndpointHandler *p_handler =
        p->iUSBDevice.iEndpointFuncs + ENDPOINT_INDEX(aEndpoint);

    // Modify the callback table while no callbacks can occur
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);

    // Are we registering an in or out endpoint?
    if (ENDPOINT_IS_IN(aEndpoint))  {
        // Is in endpoint already in use?  If not, use it.
        if (p_handler->iIn)
            error = UEZ_ERROR_NOT_AVAILABLE;
        else
            p_handler->iIn = aEndpointFunc;
    } else {
        // Is in endpoint already in use?  If not, use it.
        if (p_handler->iOut)
            error = UEZ_ERROR_NOT_AVAILABLE;
        else
            p_handler->iOut = aEndpointFunc;
    }

    UEZSemaphoreRelease(p->iSem);
    return error;
}

/*---------------------------------------------------------------------------*
 * Routine:  NXP_LPC1768_USBDevice_UnregisterEndpointCallback
 *---------------------------------------------------------------------------*
 * Description:
 *      Unregister an endpoint so the previously associated callback routine
 *      is no longer called when endpoint data was ready.
 * Inputs:
 *      void *aWorkspace          -- USB Device's workspace
 *      TUInt8 aEndpoint          -- Endpoint with callback.  Used macros
 *                                  ENDPOINT_IN or ENDPOINT_OUT for
 *                                  correct direction.
 * Outputs:
 *      T_uezError                 -- Error code UEZ_ERROR_NOT_FOUND
 *                                      is returned if endpoint is already
 *                                      unregistered, or UEZ_ERROR_NONE if
 *                                      successful.
 *---------------------------------------------------------------------------*/
static T_uezError NXP_LPC1768_USBDevice_UnregisterEndpointCallback(
            void *aWorkspace,
            TUInt8 aEndpoint)
{
    T_uezError error = UEZ_ERROR_NONE;
    T_USBDevice_LPC1768_Workspace *p =
        (T_USBDevice_LPC1768_Workspace *)aWorkspace;
    T_USBEndpointHandler *p_handler =
        p->iUSBDevice.iEndpointFuncs + ENDPOINT_INDEX(aEndpoint);

    // Modify the callback table while no callbacks can occur
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);

    // Are we unregistering an in or out endpoint?
    if (ENDPOINT_IS_IN(aEndpoint))  {
        // Is in endpoint already freed?  If not, free it.
        if (!p_handler->iIn)
            error = UEZ_ERROR_NOT_FOUND;
        else
            p_handler->iIn = 0;
    } else {
        // Is in endpoint already freed?  If not, free it.
        if (!p_handler->iOut)
            error = UEZ_ERROR_NOT_FOUND;
        else
            p_handler->iOut = 0;
    }

    UEZSemaphoreRelease(p->iSem);
    return error;
}

/*-------------------------------------------------------------------------*
 * Function:  NXP_LPC1768_USBDevice_StandardDeviceRequest
 *-------------------------------------------------------------------------*
 * Description:
 *      Handle a standard device request (as all USB devices should).
 * Inputs:
 *      void *aWorkspace          -- USB Device workspace
 *      T_USBSetupPacket *aSetup  -- Received setup packet
 *      TUInt16 *aLength          -- Place to store length of response data.
 *      TUInt8 **aData            -- Pointer to pointer to data.
 *-------------------------------------------------------------------------*/
static TBool NXP_LPC1768_USBDevice_StandardDeviceRequest(
                void *aWorkspace,
                T_USBSetupPacket *aSetup,
                TUInt16 *aLength,
                TUInt8 **aData)
{
    T_USBDevice_LPC1768_Workspace *p =
        (T_USBDevice_LPC1768_Workspace *)aWorkspace;
    TUInt8 *p_data = *aData;
    const TUInt8 *p_desc;

dprintf("[SD %d]", aSetup->iRequest);
    switch (aSetup->iRequest)  {
        case USB_DEVICE_REQUEST_GET_STATUS:
            p_data[0] = 0;
            p_data[1] = 0;
            *aLength = 2;
            return ETrue;
        case USB_DEVICE_REQUEST_CLEAR_FEATURE:
            // TBD: Not used, really needs a callback function
            *aLength = 0;
            return ETrue;
        case USB_DEVICE_REQUEST_SET_FEATURE:
            // TBD: Not used, really needs a callback function
            *aLength = 0;
            return ETrue;
        case USB_DEVICE_REQUEST_SET_ADDRESS:
    p->iNeedSetAddress = ETrue;
    p->iUSBAddress = aSetup->iValue&0x7F;

//            ((*p->iUSBDeviceController)->SetAddress)(
//                        p->iUSBDeviceController,
//                        aSetup->iValue);
#if 0
            p->iPacketLength = 0;
            p->iPacketRemaining = 0;
            p->iPacketData = p->iSmallPacket;
            IUSBCreateDataInPacket(p);
#endif
            return ETrue;
        case USB_DEVICE_REQUEST_GET_DESCRIPTOR:
            {
                p_desc = ((*p->iUSBDeviceController)->GetDescriptor)(
                        p->iUSBDeviceController,
                        (aSetup->iValue)>>8,
                        (aSetup->iValue)&0xFF,
                        aLength);
                if (p_desc)  {
                    *aData = (TUInt8 *)p_desc;
                    return ETrue;
                }
            }
            return EFalse;
        case USB_DEVICE_REQUEST_SET_DESCRIPTOR:
            return EFalse;
        case USB_DEVICE_REQUEST_GET_CONFIGURATION:
            *aLength = 1;
            p_data[0] = ((*p->iUSBDeviceController)->GetConfiguration)(
                p->iUSBDeviceController);
            return ETrue;
        case USB_DEVICE_REQUEST_SET_CONFIGURATION:
            ((*p->iUSBDeviceController)->SetConfiguration)(
                p->iUSBDeviceController,
                (aSetup->iValue & 0xFF));
            return ETrue;
        case USB_DEVICE_REQUEST_GET_INTERFACE:
        case USB_DEVICE_REQUEST_SET_INTERFACE:
        case USB_DEVICE_REQUEST_SYNCH_FRAME:
            // These are not handled
        default:
            // Anything else is definitely non standard.
            return EFalse;
    }
}

